# Manipulación de datos con Pandas
Pandas es una biblioteca de código abierto construida sobre NumPy. Se despliega como paquete de Pandas ofreciendo varios tipos de datos y operaciones para manipular datos numéricos y series numéricas.

In [ ]:
# Importar los paquetes
import numpy as np
import pandas as pd

## Series
Una serie es un arreglo unidimensional con un indice. Este arreglo puede almacenar cualquier tipo de datos.

In [ ]:
ser = pd.Series(dtype=np.float64)
print(ser)
print(ser.__class__)

In [ ]:
a = [1, 7, 2]
s = pd.Series(a)
s

In [ ]:
# Cada valor de una serie tiene un indice (puede estar repetido) que lo identifica
s[0], s[1], s[2]

In [ ]:
# El indice puede especificarse (si no se especifica el indice, este se genera automaticamente como autonumerico)
s2 = pd.Series([2, 5, 8], index=['a', 'c', 'x'])
s2

In [ ]:
# El acceso es por el indice
s2['a'], s2['c'], s2['x']

In [ ]:
# Si el valor del indice esta duplicado ...
s2 = pd.Series([2, 5, 8, 13], index=['a', 'c', 'x', 'a'])
print(s2['a'])
print(s2['a'].__class__)

In [ ]:
# Inicializar usando un diccionario
calories = {"day1": 420, "day2": 380, "day3": 390}
pd.Series(calories)

In [ ]:
# Si se asigna un indice, solamente los valores en el indice se crearan
calories = {"day1": 420, "day2": 380, "day3": 390}
pd.Series(calories, index = ['day1', 'day2'])

## DataFrames

Un DataFrame es una tabla bidimensional, de tamaño variable, y potencialmente heterogénea. Al igual que las Series, cada fila tiene un índice. Cada columna de la tabla también tiene un índice.

In [ ]:
# Creating a DataFrame from a dictionary
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 22, 35],
    'City': ['New York', 'Los Angeles', 'Chicago', 'Houston']
}

df = pd.DataFrame(data)
df

Cada columna de la tabla se puede acceder por el valor del índice, y el resultado es una serie con el mismo índice

In [ ]:
df['Name']

# Data Exploration
## Loading data
There are different read_ methods for different file formats. In some cases you should provide some arguments, like the seet_name in excel spreadsheets.

In [126]:
df = pd.read_csv('data/cardio.csv')

# Display the first 5 rows of the DataFrame
df.head()

   Duration          Date  Pulse  Maxpulse  Calories
0        60  '2020/12/01'    110       130     409.1
1        60  '2020/12/02'    117       145     479.0
2        60  '2020/12/03'    103       135     340.0
3        45  '2020/12/04'    109       175     282.4
4        45  '2020/12/05'    117       148     406.0

In [127]:
df = pd.read_excel('data/onei_data.xls', sheet_name='poblacion')
df.head(5)

   AÑOS CENSALES    Total Hombres Mujeres  Tasa Hombres Tasa Mujeres
0           1774   171620     ...     ...           NaN          ...
1           1792   273979     ...     ...          25.0          ...
2           1817   553033     ...     ...          27.0          ...
3           1827   704487     ...     ...          24.1          ...
4           1841  1007624     ...     ...          26.0          ...

In [128]:
df = pd.read_excel('data/onei_data.xls', sheet_name='poblacion por provincia')
df.head(5)

       PROVINCIAS        2017        2018        2019        2020        2021
0            Cuba  11230142.0  11215344.0  11201549.0  11187532.5  11147405.0
1   Pinar del Río    587377.5    586019.0    584967.0    583708.0    580823.0
2        Artemisa    507347.0    509785.0    512110.0    513736.5    513052.5
3       La Habana   2129817.0   2130516.5   2131937.0   2132288.5   2130872.0
4       Mayabeque    382074.0    382931.0    383636.0    384129.0    383144.5

## Indexing and slicing
You can use .loc[] to select rows and columns by label and .iloc[] to select them by integer position.

In [129]:
df['PROVINCIAS']

0                     Cuba
1            Pinar del Río
2                 Artemisa
3                La Habana
4                Mayabeque
5                 Matanzas
6              Villa Clara
7               Cienfuegos
8          Sancti Spíritus
9           Ciego de Ávila
10                Camagüey
11               Las Tunas
12                Holguín
13                  Granma
14        Santiago de Cuba
15              Guantánamo
16     Isla de la Juventud
Name: PROVINCIAS, dtype: object

In [130]:
df.PROVINCIAS

0                     Cuba
1            Pinar del Río
2                 Artemisa
3                La Habana
4                Mayabeque
5                 Matanzas
6              Villa Clara
7               Cienfuegos
8          Sancti Spíritus
9           Ciego de Ávila
10                Camagüey
11               Las Tunas
12                Holguín
13                  Granma
14        Santiago de Cuba
15              Guantánamo
16     Isla de la Juventud
Name: PROVINCIAS, dtype: object

In [131]:
df.columns

Index(['PROVINCIAS', 2017, 2018, 2019, 2020, 2021], dtype='object')

In [132]:
df.loc[0:2, ['PROVINCIAS', 2017]]

       PROVINCIAS        2017
0            Cuba  11230142.0
1   Pinar del Río    587377.5
2        Artemisa    507347.0

In [133]:
df.iloc[4]

PROVINCIAS     Mayabeque
2017            382074.0
2018            382931.0
2019            383636.0
2020            384129.0
2021            383144.5
Name: 4, dtype: object

In [134]:
df.iloc[3:7, 1:4]

        2017       2018       2019
3  2129817.0  2130516.5  2131937.0
4   382074.0   382931.0   383636.0
5   711062.5   713630.5   715801.5
6   786050.5   782496.5   779124.5

Boolean indexing

In [135]:
df[df.PROVINCIAS == " Mayabeque"]

   PROVINCIAS      2017      2018      2019      2020      2021
4   Mayabeque  382074.0  382931.0  383636.0  384129.0  383144.5

In [136]:
df[df.PROVINCIAS.isin({" Mayabeque", " Artemisa", " Pinar del Río"})]

       PROVINCIAS      2017      2018      2019      2020      2021
1   Pinar del Río  587377.5  586019.0  584967.0  583708.0  580823.0
2        Artemisa  507347.0  509785.0  512110.0  513736.5  513052.5
4       Mayabeque  382074.0  382931.0  383636.0  384129.0  383144.5

In [137]:
df[df.PROVINCIAS.isin({" Mayabeque", " Artemisa", " Pinar del Río"}) &
  (df[2017] > 500000)]

       PROVINCIAS      2017      2018      2019      2020      2021
1   Pinar del Río  587377.5  586019.0  584967.0  583708.0  580823.0
2        Artemisa  507347.0  509785.0  512110.0  513736.5  513052.5

## Descriptive Statistics

In [138]:
df.describe()

               2017          2018          2019          2020          2021
count  1.700000e+01  1.700000e+01  1.700000e+01  1.700000e+01  1.700000e+01
mean   1.321193e+06  1.319452e+06  1.317829e+06  1.316180e+06  1.311459e+06
std    2.591267e+06  2.587915e+06  2.584820e+06  2.581649e+06  2.572588e+06
min    8.427250e+04  8.390700e+04  8.367250e+04  8.358450e+04  8.360150e+04
25%    4.661450e+05  4.658555e+05  4.654290e+05  4.644610e+05  4.623470e+05
50%    5.873775e+05  5.860190e+05  5.849670e+05  5.837080e+05  5.808230e+05
75%    8.290670e+05  8.252810e+05  8.216965e+05  8.187525e+05  8.139505e+05
max    1.123014e+07  1.121534e+07  1.120155e+07  1.118753e+07  1.114740e+07

In [140]:
df.isna().sum()

PROVINCIAS    0
2017          0
2018          0
2019          0
2020          0
2021          0
dtype: int64

# Grouping data with groupby()
Grouping allows you to split your data into groups based on some criteria and perform aggregate operations within those groups.

In [141]:
data = {
    'Category': ['A', 'B', 'A', 'B', 'A', 'A'],
    'Value': [10, 15, 20, 25, 30, 35],
    'Value2': [23.4, 12.5, 8.7, 9.4, 17.6, 15.9]
}

df = pd.DataFrame(data)
df

  Category  Value  Value2
0        A     10    23.4
1        B     15    12.5
2        A     20     8.7
3        B     25     9.4
4        A     30    17.6
5        A     35    15.9

In [142]:
# Grouping by 'Category'
df.groupby('Category').mean()

          Value  Value2
Category
A         23.75   16.40
B         20.00   10.95

In [143]:
# Getting only on 'Value'
df.groupby('Category')['Value'].mean()

Category
A    23.75
B    20.00
Name: Value, dtype: float64

In [144]:
# Applying multiple aggregation functions to the grouped data
df.groupby('Category')['Value'].agg(['mean', 'sum', 'count'])

           mean  sum  count
Category
A         23.75   95      4
B         20.00   40      2

In [145]:
# To group on more columns, lets create a larger dataframe
np.random.seed(0)
n = 100
data = {
    'Category': np.random.choice(['A', 'B', 'C'], size=n),
    'Subcategory': np.random.choice(['X', 'Y', 'Z'], size=n),
    'Value': np.random.randint(1, 101, size=n)
}
df = pd.DataFrame(data)
df.head(10)

  Category Subcategory  Value
0        A           Z     25
1        B           Y     68
2        A           X     83
3        B           Y      4
4        B           Y     77
5        C           X     36
6        A           Z     87
7        C           Z     62
8        A           Z     70
9        A           Z     88

In [146]:
df.groupby(['Category', 'Subcategory']).sum()

                      Value
Category Subcategory
A        X              454
         Y              649
         Z              770
B        X              628
         Y              576
         Z              467
C        X              376
         Y              247
         Z              481

In [147]:
grouped = df.groupby(['Category', 'Subcategory']).agg(['mean', 'sum'])
grouped

                          Value
                           mean  sum
Category Subcategory
A        X            41.272727  454
         Y            46.357143  649
         Z            55.000000  770
B        X            44.857143  628
         Y            57.600000  576
         Z            46.700000  467
C        X            37.600000  376
         Y            41.166667  247
         Z            43.727273  481

In [148]:
# Note that the result uses a different kind of index, the MultiIndex
grouped.index

MultiIndex([('A', 'X'),
            ('A', 'Y'),
            ('A', 'Z'),
            ('B', 'X'),
            ('B', 'Y'),
            ('B', 'Z'),
            ('C', 'X'),
            ('C', 'Y'),
            ('C', 'Z')],
           names=['Category', 'Subcategory'])

# Merging and concatenating datasets
Merging and concatenating DataFrames are common operations in data manipulation when working with multiple datasets

In [149]:
# Merging dataframes

df1 = pd.DataFrame({'ID': [1, 2, 3], 'Name': ['Alice', 'Bob', 'Charlie']})
df1

   ID     Name
0   1    Alice
1   2      Bob
2   3  Charlie

In [150]:
df2 = pd.DataFrame({'ID': [2, 3, 4], 'Age': [25, 30, 22]})
df2

   ID  Age
0   2   25
1   3   30
2   4   22

In [151]:
# with 'inner'
pd.merge(df1, df2, on='ID', how='inner')

   ID     Name  Age
0   2      Bob   25
1   3  Charlie   30

In [152]:
# with 'left'
pd.merge(df1, df2, on='ID', how='left')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  25.0
2   3  Charlie  30.0

In [154]:
# with 'right'
pd.merge(df1, df2, on='ID', how='outer')

   ID     Name   Age
0   1    Alice   NaN
1   2      Bob  25.0
2   3  Charlie  30.0
3   4      NaN  22.0

Concatenation involves stacking DataFrames on top of each other (along rows) or side by side (along columns)

In [155]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})
print(df1)
print('*' * 10)
print(df2)

   A  B
0  1  3
1  2  4
**********
   A  B
0  5  7
1  6  8

In [156]:
# Concatenate along rows (vertically)
pd.concat([df1, df2])

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

In [157]:
# Note, indexes values are dupplicated now
pd.concat([df1, df2]).index

Int64Index([0, 1, 0, 1], dtype='int64')

In [158]:
# Concatenate along columns (horizontally)
pd.concat([df1, df2], axis=1)

   A  B  A  B
0  1  3  5  7
1  2  4  6  8

# Reshaping data with pivot, melt, and stack/unstack
Pivoting is a technique for reorganizing data from a long format to a wide format.

In [159]:
import pandas as pd

# Create a long-format DataFrame
data = {'Date': ['2023-01-01', '2023-01-02', '2023-01-01', '2023-01-02'],
        'Variable': ['A', 'A', 'B', 'B'],
        'Value': [10, 15, 20, 25]}

df = pd.DataFrame(data)
df

         Date Variable  Value
0  2023-01-01        A     10
1  2023-01-02        A     15
2  2023-01-01        B     20
3  2023-01-02        B     25

In [160]:
# Pivot the DataFrame from long to wide format
df.pivot(index='Date', columns='Variable', values='Value')

Variable     A   B
Date
2023-01-01  10  20
2023-01-02  15  25

Melt is the reverse operation of pivot, where you transform wide-format data into a long format

In [161]:
# Melt the DataFrame from wide to long format
pivot_df.reset_index().melt(id_vars='Date', var_name='Variable', value_name='Value')

         Date Variable  Value
0  2023-01-01        A     10
1  2023-01-02        A     15
2  2023-01-01        B     20
3  2023-01-02        B     25

Stacking and unstacking allow you to move data between rows and columns

In [162]:
data = {'Category': ['A', 'B'],
        'Subcategory': ['X', 'Y'],
        'Value1': [10, 20],
        'Value2': [30, 40]}
df = pd.DataFrame(data)
df.set_index(['Category', 'Subcategory'], inplace=True)
df

                      Value1  Value2
Category Subcategory
A        X                10      30
B        Y                20      40

In [163]:
stacked_df = df.stack()
stacked_df

Category  Subcategory
A         X            Value1    10
                       Value2    30
B         Y            Value1    20
                       Value2    40
dtype: int64

In [164]:
stacked_df.index

MultiIndex([('A', 'X', 'Value1'),
            ('A', 'X', 'Value2'),
            ('B', 'Y', 'Value1'),
            ('B', 'Y', 'Value2')],
           names=['Category', 'Subcategory', None])

In [165]:
unstacked_df = stacked_df.unstack()
unstacked_df

                      Value1  Value2
Category Subcategory
A        X                10      30
B        Y                20      40